# Load SQL and Connect to DB

In [ ]:
%load_ext sql

**Connect to DB**

In [ ]:
%env DATABASE_URL = postgresql://shubham_sms_user:shubham@172.25.87.65:5432/shubham_sms_db

# Performing Aggregation

**Let us uderstand how to aggregate the data**

- We can Perform global aggergation as well as aggregation by key.
- Typical query execution -`FROM -> WHERE -> GROUP BY -> SELECT -> HAVING`

## Global Aggregation

1. Get total Number of orders.

In [3]:
%%sql 

select count(order_id) from shubham.orders;

1 rows affected.

[(68883,)]

2. Get revenue for a given order id.
    - Check the data for order id 2 
    - Perform aggregation based on the details.

In [4]:
%%sql 

select * from shubham.order_items
    where order_item_order_id = 2;

 * postgresql://shubham_sms_user:***@172.25.87.65:5432/shubham_sms_db
3 rows affected.

[(2, 2, 1073, 1, 199.99, 199.99),
 (3, 2, 502, 5, 250.0, 50.0),
 (4, 2, 403, 1, 129.99, 129.99)]

In [5]:
%%sql 

    select round(sum(order_item_subtotal::numeric), 2) as Revenue
        from shubham.order_items
            where order_item_order_id = 2 ;

 * postgresql://shubham_sms_user:***@172.25.87.65:5432/shubham_sms_db
1 rows affected.

[(Decimal('579.98'),)]

3. Get number of records with order_status either COMPLETED or CLOSED.
     - See the values of order_status.
     - Count the required status.

In [6]:
%%sql

    select distinct(order_status) as Status_Count
        from shubham.orders;

 * postgresql://shubham_sms_user:***@172.25.87.65:5432/shubham_sms_db
9 rows affected.

[('COMPLETE',),
 ('ON_HOLD',),
 ('PENDING_PAYMENT',),
 ('PENDING',),
 ('CLOSED',),
 ('CANCELED',),
 ('PROCESSING',),
 ('PAYMENT_REVIEW',),
 ('SUSPECTED_FRAUD',)]

In [7]:
%%sql

    select count(*) as Status_Count
        from shubham.orders
            where order_status in ('COMPLETE','CLOSED');

 * postgresql://shubham_sms_user:***@172.25.87.65:5432/shubham_sms_db
1 rows affected.

[(30455,)]

## Aggregation by key - using **GROUP BY**

- Rules while using **GROUP BY**.
    - We can have the columns which are specified as part of **GROUP BY** in  **SELECT** clause.
    - On top of those, we can have derived columns using aggregate functions.
    - We can hve any other columns that are nit used as pwrt of **GROUP BY** or derived column using non aggregated functions.
    - We will not be able to use aggregated functions or aliases used in the select clause as part of the where clause.
    - if we want to filter based on aggregated results, then we can leverage **HAVING** on top of **GROUP BY** (specifying **WHERE** is not an option).

1. Get number of orders by date or status.
    - Check the data for refrence
    - apply the aggregation

In [8]:
%%sql 
    select * from shubham.orders limit 2;

 * postgresql://shubham_sms_user:***@172.25.87.65:5432/shubham_sms_db
2 rows affected.

[(1, datetime.datetime(2013, 7, 25, 0, 0), 11599, 'CLOSED'),
 (2, datetime.datetime(2013, 7, 25, 0, 0), 256, 'PENDING_PAYMENT')]

In [9]:
%%sql 

    select order_date, count (*)
        from shubham.orders
            group by order_date 
                order by order_date
                    limit 5;

 * postgresql://shubham_sms_user:***@172.25.87.65:5432/shubham_sms_db
5 rows affected.

[(datetime.datetime(2013, 7, 25, 0, 0), 143),
 (datetime.datetime(2013, 7, 26, 0, 0), 269),
 (datetime.datetime(2013, 7, 27, 0, 0), 202),
 (datetime.datetime(2013, 7, 28, 0, 0), 187),
 (datetime.datetime(2013, 7, 29, 0, 0), 253)]

 2. Get revenue for each order_id.
     - Check the data for refrence. 
     - apply the aggregation.

In [10]:
%%sql 

    select * from shubham.order_items limit 5;

 * postgresql://shubham_sms_user:***@172.25.87.65:5432/shubham_sms_db
5 rows affected.

[(1, 1, 957, 1, 299.98, 299.98),
 (2, 2, 1073, 1, 199.99, 199.99),
 (3, 2, 502, 5, 250.0, 50.0),
 (4, 2, 403, 1, 129.99, 129.99),
 (5, 4, 897, 2, 49.98, 24.99)]

In [11]:
%%sql

    select order_item_order_id , round( sum(order_item_subtotal :: numeric),2 ) as revenue
        from shubham.order_items
            group by order_item_order_id
                order by order_item_order_id 
                    limit 5;

 * postgresql://shubham_sms_user:***@172.25.87.65:5432/shubham_sms_db
5 rows affected.

[(1, Decimal('299.98')),
 (2, Decimal('579.98')),
 (4, Decimal('699.85')),
 (5, Decimal('1129.86')),
 (7, Decimal('579.92'))]

3.  Get daily product revenue (using order date and product id as keys).
     - Check the data for refrence. 
     - apply the aggregation.

In [15]:
%%sql 
    
    select * from shubham.order_items limit 10;

 * postgresql://shubham_sms_user:***@172.25.87.65:5432/shubham_sms_db
10 rows affected.

[(1, 1, 957, 1, 299.98, 299.98),
 (2, 2, 1073, 1, 199.99, 199.99),
 (3, 2, 502, 5, 250.0, 50.0),
 (4, 2, 403, 1, 129.99, 129.99),
 (5, 4, 897, 2, 49.98, 24.99),
 (6, 4, 365, 5, 299.95, 59.99),
 (7, 4, 502, 3, 150.0, 50.0),
 (8, 4, 1014, 4, 199.92, 49.98),
 (9, 5, 957, 1, 299.98, 299.98),
 (10, 5, 365, 5, 299.95, 59.99)]

In [14]:
%%sql 


  select * from shubham.orders limit 10;

 * postgresql://shubham_sms_user:***@172.25.87.65:5432/shubham_sms_db
10 rows affected.

[(1, datetime.datetime(2013, 7, 25, 0, 0), 11599, 'CLOSED'),
 (2, datetime.datetime(2013, 7, 25, 0, 0), 256, 'PENDING_PAYMENT'),
 (3, datetime.datetime(2013, 7, 25, 0, 0), 12111, 'COMPLETE'),
 (4, datetime.datetime(2013, 7, 25, 0, 0), 8827, 'CLOSED'),
 (5, datetime.datetime(2013, 7, 25, 0, 0), 11318, 'COMPLETE'),
 (6, datetime.datetime(2013, 7, 25, 0, 0), 7130, 'COMPLETE'),
 (7, datetime.datetime(2013, 7, 25, 0, 0), 4530, 'COMPLETE'),
 (8, datetime.datetime(2013, 7, 25, 0, 0), 2911, 'PROCESSING'),
 (9, datetime.datetime(2013, 7, 25, 0, 0), 5657, 'PENDING_PAYMENT'),
 (10, datetime.datetime(2013, 7, 25, 0, 0), 5648, 'PENDING_PAYMENT')]

In [21]:
%%sql 

    select o.order_date,
           oi.order_item_product_id,
           round (sum(oi.order_item_subtotal:: numeric),2 ) as revenue
                from shubham.orders as o
                    join shubham.order_items as oi
                        on o.order_id = oi.order_item_order_id
                where o.order_status in ('COMPLETE','CLOSED')
                    group by o.order_date, oi.order_item_product_id
                    order by o.order_date, oi.order_item_product_id
                        limit 10

 * postgresql://shubham_sms_user:***@172.25.87.65:5432/shubham_sms_db
10 rows affected.

[(datetime.datetime(2013, 7, 25, 0, 0), 24, Decimal('319.96')),
 (datetime.datetime(2013, 7, 25, 0, 0), 93, Decimal('74.97')),
 (datetime.datetime(2013, 7, 25, 0, 0), 134, Decimal('100.00')),
 (datetime.datetime(2013, 7, 25, 0, 0), 191, Decimal('5099.49')),
 (datetime.datetime(2013, 7, 25, 0, 0), 226, Decimal('599.99')),
 (datetime.datetime(2013, 7, 25, 0, 0), 365, Decimal('3359.44')),
 (datetime.datetime(2013, 7, 25, 0, 0), 403, Decimal('1949.85')),
 (datetime.datetime(2013, 7, 25, 0, 0), 502, Decimal('1650.00')),
 (datetime.datetime(2013, 7, 25, 0, 0), 572, Decimal('119.97')),
 (datetime.datetime(2013, 7, 25, 0, 0), 625, Decimal('199.99'))]

### We can also use **HAVING** clause to apply filtering on top of aggregated data.
    - Get daily product revenue where revenue is grater than `$500` (using order date and product id as keys)

In [22]:
%%sql 

    select o.order_date,
           oi.order_item_product_id,
           round (sum(oi.order_item_subtotal:: numeric),2 ) as revenue
                from shubham.orders as o
                    join shubham.order_items as oi
                        on o.order_id = oi.order_item_order_id
                where o.order_status in ('COMPLETE','CLOSED')
                    group by o.order_date, oi.order_item_product_id
                    having  round (sum(oi.order_item_subtotal:: numeric),2 )>= 500
                    order by o.order_date, oi.order_item_product_id, revenue DESC
                        limit 10

 * postgresql://shubham_sms_user:***@172.25.87.65:5432/shubham_sms_db
10 rows affected.

[(datetime.datetime(2013, 7, 25, 0, 0), 191, Decimal('5099.49')),
 (datetime.datetime(2013, 7, 25, 0, 0), 226, Decimal('599.99')),
 (datetime.datetime(2013, 7, 25, 0, 0), 365, Decimal('3359.44')),
 (datetime.datetime(2013, 7, 25, 0, 0), 403, Decimal('1949.85')),
 (datetime.datetime(2013, 7, 25, 0, 0), 502, Decimal('1650.00')),
 (datetime.datetime(2013, 7, 25, 0, 0), 627, Decimal('1079.73')),
 (datetime.datetime(2013, 7, 25, 0, 0), 957, Decimal('4499.70')),
 (datetime.datetime(2013, 7, 25, 0, 0), 1004, Decimal('5599.72')),
 (datetime.datetime(2013, 7, 25, 0, 0), 1014, Decimal('2798.88')),
 (datetime.datetime(2013, 7, 25, 0, 0), 1073, Decimal('2999.85'))]